In [3]:
import pandas as pd

In [4]:
df1 = pd.read_csv('Admission_predict.csv')

In [7]:
df1.columns

Index(['Serial No.', 'GRE Score', 'TOEFL Score', 'University Rating', 'SOP',
       'LOR ', 'CGPA', 'Research', 'Chance of Admit '],
      dtype='object')

In [ ]:
# 1 Display all rows where GRE Score is greater than 320.
gre_320 = df1[df1['GRE Score'] > 320]

In [21]:
# 2.Show applicants whose TOEFL Score is less than 100.
toefl_score = df1[df1['TOEFL Score'] < 100]

In [26]:
# 3 Get records where University Rating equals 5.
uni_rating = df1[df1['University Rating']==5]

In [30]:
# 4 Select all students who have done Research (value 1).
res_1 = df1[df1['Research']==1]

In [31]:
# 5 Display students who have not done Research (value 0).
res_0 = df1[df1['Research']==0]

In [34]:
# 6 Find applicants with CGPA greater than 9.0.
cgpa_9 = df1[df1['CGPA'] > 9]

In [37]:
# 7 Retrieve records where both GRE Score > 320 and CGPA > 9.0.
gre_cgpa = df1[(df1['GRE Score'] > 320) & (df1['CGPA'] > 9)]

In [43]:
# 8 Display records where either SOP or LOR rating is 5.0.
sop_lor = df1[(df1['SOP']==5) | (df1['LOR ']==5)]

In [45]:
# 9 Find all rows where TOEFL Score is between 100 and 110.
toefl_scr = df1[(df1['TOEFL Score'] > 100) & (df1['TOEFL Score'] < 110)]

In [49]:
# 10 Display data for students whose GRE Score is not equal to 300.
gre_scr = df1[df1['GRE Score'] != 300]

In [52]:
# 11 Show all students with CGPA less than 8 and Research = 1.
cgpa_research = df1[(df1['CGPA'] < 8) & (df1['Research'] == 1)]

In [55]:
# 12 Retrieve rows where University Rating < 3 and SOP > 4.
sop_uni = df1[(df1['University Rating'] < 3) & (df1['SOP'] > 4)]

In [58]:
# 13. Get records of students having TOEFL Score > 105 but GRE Score < 310.
toefl_gre = df1[(df1['TOEFL Score'] > 105) & (df1['GRE Score'] < 310)]

In [61]:
# 14. Display records where Chance of Admit < 0.6 or GRE Score < 300.
admit_gre = df1[(df1['Chance of Admit '] < 0.6) | (df1['GRE Score'] < 300)]

In [83]:
# 15. Find the top 10 students with the highest GRE Score.

top_10_gre = df1.sort_values(by = 'GRE Score',ascending = False).head(10)

In [87]:
# 16 Display applicants who scored exactly 4.5 in LOR.
lor_4 = df1[df1['LOR '] == 4.5]

In [90]:
# 17 Select students whose SOP rating lies between 3 and 4 (inclusive).
sop_3_4 = df1[(df1['SOP'] > 3) & (df1['SOP'] < 4)]

In [93]:
# 18 Display all students whose University Rating is either 2 or 3.
uni_rating =  df1[(df1['University Rating']== 2) | (df1['University Rating']==3)]

In [102]:
# 19 Filter rows where CGPA is an integer value (e.g., 8.0, 9.0).
int_val = df1[df1['CGPA'] % 1 == 0]

In [105]:
# 20 Retrieve records where Chance of Admit is between 0.5 and 0.7.
admit_chances = df1[(df1['Chance of Admit '] > 0.5) & (df1['Chance of Admit '] < 0.7)]

In [109]:
#21 Select students who scored below average GRE Score.

gre_below = df1[(df1['GRE Score'] < df1['GRE Score'].mean())]

In [113]:
#22 Show all records where TOEFL Score equals the dataset’s maximum TOEFL Score.

max_toefl = df1[df1['TOEFL Score'] == df1['TOEFL Score'].max()]

In [115]:
#23 Filter students who have both LOR and SOP less than 3.
lor_sor = df1[(df1['LOR '] < 3) & (df1['SOP'] < 3)]

In [117]:
#24 Retrieve students who have GRE Score divisible by 5. 
gre_by_5 = df1[df1['GRE Score'] % 5 == 0]

In [118]:
# 25 Add a new column named GRE_to_TOEFL_Ratio = GRE Score / TOEFL Score.
df1['GRE_to_TOEFL_Ratio'] = df1['GRE Score'] / df1['TOEFL Score']

In [122]:
# 26 Create a new column Admission_Chance_% = Chance of Admit × 100.
df1['Admission_Chance_%'] = df1['Chance of Admit '] * 100

In [130]:
# 27 Rename the column Chance of Admit to Admit_Probability.
rename = df1.rename(columns = {'Chance of Admit ': 'Admit_Probability'})

In [178]:
#28 Change all column names to lowercase.
df1.columns = df1.columns.str.lower()

In [186]:
#29 Drop the column Serial No..
drop = df1.drop(columns = ['Serial No.'])

In [199]:
#30 Round all values in CGPA to one decimal place.
df1['CGPA'] = df1['CGPA'].round(1)

In [200]:
df1.columns

Index(['Serial No.', 'GRE Score', 'TOEFL Score', 'University Rating', 'SOP',
       'LOR ', 'CGPA', 'Research', 'Chance of Admit '],
      dtype='object')

In [206]:
#31 Replace all University Rating values of 5 with 10.
df1['University Rating'] = df1['University Rating'].replace(5,10)

In [209]:
#32 Convert Research column values from 0/1 to “No”/“Yes”.
dd = df1
def convert_research(x):
    if x == 0:
        return 'No'
    elif x == 1:
        return 'Yes'

dd['Research'] = dd['Research'].apply(convert_research)

Research
Yes    219
No     181
Name: count, dtype: int64

In [226]:
#32 Convert Research column values from 0/1 to “No”/“Yes”.
d2 = df1
d2['Research'] = d2['Research'].replace({0:'No',1:'Yes'})

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,Yes,0.92
1,2,324,107,4,4.0,4.5,8.87,Yes,0.76
2,3,316,104,3,3.0,3.5,8.00,Yes,0.72
3,4,322,110,3,3.5,2.5,8.67,Yes,0.80
4,5,314,103,2,2.0,3.0,8.21,No,0.65

In [212]:
#33 Create a new column GRE_Level = “High” if GRE ≥ 320 else “Low”.
d1 = df1
def convert_gre_lvl(x):
    if x >= 320:
        return 'High'
    else:
        return 'Low'
    
d1['GRE_Level'] = d1['GRE Score'].apply(convert_gre_lvl)

In [242]:
#34 Normalize CGPA column to range 0–1 using min-max scaling (without sklearn).
minn = df1['CGPA'].min()
maxx = df1['CGPA'].max()

df1['cgpa_normalize'] = (df1['CGPA'] - minn) / (maxx - minn)

In [235]:
#35 Increase all TOEFL Score values by 2 points.
df1['TOEFL Score'] = df1['TOEFL Score'] + 2

In [238]:
#36 Add a column Weighted_Score = GRE Score * 0.3 + TOEFL Score * 0.2 + CGPA * 0.5.
df1['Weighted_Score'] = df1['GRE Score'] * 0.3 + df1['TOEFL Score'] * 0.2 + df1['CGPA'] * 0.5

In [253]:
#37 Drop all duplicate rows if any.
dd = df1.drop_duplicates()
dd.duplicated().sum()

np.int64(0)

In [264]:
#38 Replace all SOP values less than 2 with the mean SOP.
mean = df1['SOP'].mean()
def convert_sop(x):
    if x >= 2:
        return x
    else:
        return mean

df1['SOP'] =df1['SOP'].apply(convert_sop)

In [268]:
#39 Create a new column combining University Rating and Research (e.g., "Rating-Research").
df1['Rating-Research'] = df1['University Rating'] + df1['Research']

In [270]:
df1.columns

Index(['Serial No.', 'GRE Score', 'TOEFL Score', 'University Rating', 'SOP',
       'LOR ', 'CGPA', 'Research', 'Chance of Admit ', 'Rating-Research'],
      dtype='object')

In [9]:
#40 Convert Chance of Admit to categorical bins: “Low”, “Medium”, “High”.
dd = df1.copy()
mean = dd['Chance of Admit '].mean()

def cato_bin(x):
    if x == mean:
        return 'Medium'
    elif x > mean:
        return 'High'
    else:
        return 'Low'

dd['categorical bins'] = dd['Chance of Admit '].apply(cato_bin)

In [12]:
#41 Add a constant column Country with value “India”.
dd = df1.copy()
dd['Country'] = 'India'

In [ ]:
#42 Reorder columns so that Chance of Admit comes first.

In [18]:
#43 Replace values in LOR column where rating is 5 with 4.9.
dd = df1.copy()
dd['LOR '] = dd['LOR '].replace(5,4.9)

In [29]:
#44 Convert all float columns to integers (after rounding).
dd = df1.copy()

dd = dd.round().astype('int')

In [32]:
#45 Replace CGPA values above 9.5 with 9.5.
dd = df1.copy()
dd['CGPA_name'] = dd['CGPA'].apply(lambda x: 9.5 if x > 9.5 else x)

In [36]:
#46 Apply a lambda function to square all SOP values.
dd = df1.copy()

dd['sop_sqr'] = dd['SOP'].apply(lambda x: x**2)

In [41]:
#47 Add a column GRE_Category = “Below Avg”, “Avg”, “Above Avg” based on mean GRE.
dd = df1.copy()
mean = dd['GRE Score'].mean()
dd['GRE_Category'] = dd['GRE Score'].apply(lambda x: 'Above Avg' if x > mean else('Avg' if x == mean else 'Below Avg'))

In [46]:
#48 Standardize column names to snake_case (lowercase, replace spaces with _).
dd = df1.copy()

dd.columns = dd.columns.str.lower().str.replace(' ','_')

In [50]:
#49 Create a new column showing difference between TOEFL Score and GRE Score/4.
dd = df1.copy()
dd['TOEFL_GRE_diff'] = dd['TOEFL Score'] - (dd['GRE Score']/4)

In [51]:
#50 Find the average GRE Score for each University Rating.
dd = df1.copy()

avg_uni = dd.groupby('University Rating')['GRE Score'].mean()
avg_uni

University Rating
1    303.153846
2    309.177570
3    315.954887
4    324.824324
5    328.333333
Name: GRE Score, dtype: float64

In [56]:
#51 Get the mean CGPA for students with and without research.
dd = df1.copy()

with_re = dd[dd['Research']== 1]
with_cgpa = with_re['CGPA'].mean()
print(with_cgpa)

without_re = dd[dd['Research']==0]
without_cgpa = without_re['CGPA'].mean()
print(without_cgpa)

8.881369863013699
8.257182320441988

In [58]:
#52 Count how many applicants have each University Rating.
dd = df1.copy()
dd['University Rating'].value_counts()

University Rating
3    133
2    107
4     74
5     60
1     26
Name: count, dtype: int64

In [60]:
#53 Find the total number of students in each Research category.
dd = df1.copy()
dd['Research'].value_counts()

Research
1    219
0    181
Name: count, dtype: int64

In [61]:
#54 Group by University Rating and show average TOEFL Score.
dd = df1.copy()

avg_TOEFL = dd.groupby('University Rating')['TOEFL Score'].mean()
avg_TOEFL

University Rating
1     99.076923
2    103.523364
3    106.887218
4    111.824324
5    113.666667
Name: TOEFL Score, dtype: float64

In [69]:
#55 Get the maximum Chance of Admit for each Research group.

res_1 = df1[df1['Research']==1]
max_1 = res_1['Chance of Admit '].max()
print(max_1)

res_0 = df1[df1['Research']==0]
max_0 = res_0['Chance of Admit '].max()
print(max_0)

0.97
0.89

In [72]:
# 56 Find minimum SOP value per University Rating.
dd = df1.copy()

min_sop = dd.groupby('University Rating')['SOP'].min()
min_sop

University Rating
1    1.0
2    1.0
3    2.0
4    1.5
5    3.0
Name: SOP, dtype: float64

In [77]:
#57 Count number of students with GRE Score ≥ 320 for each University Rating.
dd = df1.copy()

gre_320 = dd[dd['GRE Score'] >= 320]
gre_score_count = gre_320.groupby('University Rating')['GRE Score'].count()
gre_score_count

University Rating
2    11
3    49
4    59
5    56
Name: GRE Score, dtype: int64

In [80]:
#58 Calculate median CGPA grouped by Research.

dd = df1.copy()

median_cgpa = dd.groupby('Research')['CGPA'].median()
median_cgpa

Research
0    8.27
1    8.97
Name: CGPA, dtype: float64

In [82]:
#59 Get the number of students per combination of University Rating and Research.
dd = df1.copy()
uni_rat = dd['University Rating'].value_counts()
print(uni_rat)

res = dd['Research'].value_counts()
print(res)

University Rating
3    133
2    107
4     74
5     60
1     26
Name: count, dtype: int64
Research
1    219
0    181
Name: count, dtype: int64

In [88]:
# 60 Find the mean GRE Score grouped by both Research and SOP.
dd = df1.copy()
sop_res = dd.groupby(['Research','SOP'])
mean_gre = sop_res['GRE Score'].mean()
mean_gre

Research  SOP
0         1.0    302.400000
          1.5    301.117647
          2.0    308.481481
          2.5    307.696970
          3.0    311.352941
          3.5    310.925926
          4.0    311.476190
          4.5    320.833333
          5.0    306.400000
1         1.0    312.000000
          1.5    308.666667
          2.0    309.166667
          2.5    315.571429
          3.0    316.800000
          3.5    319.023256
          4.0    325.653061
          4.5    328.000000
          5.0    330.218750
Name: GRE Score, dtype: float64

In [97]:
#61 For each University Rating, find both min and max TOEFL Score.
dd = df1.copy()
minn = dd.groupby('University Rating')['TOEFL Score'].min()
print(minn)

maxx = dd.groupby('University Rating')['TOEFL Score'].max()
print(maxx)

University Rating
1     92
2     95
3     97
4    100
5    103
Name: TOEFL Score, dtype: int64
University Rating
1    109
2    118
3    120
4    120
5    120
Name: TOEFL Score, dtype: int64

In [101]:
dd = df1.copy()

min_max_TOEFL = dd.groupby('University Rating')['TOEFL Score'].agg(['min','max'])
min_max_TOEFL

                   min  max
University Rating
1                   92  109
2                   95  118
3                   97  120
4                  100  120
5                  103  120

In [110]:
#62 Display number of unique GRE Score values per University Rating.
dd = df1.copy()

unique_gre = dd.groupby('University Rating')
unique_gre['GRE Score'].unique()

University Rating
1    [302, 295, 300, 304, 294, 318, 297, 315, 298, ...
2    [314, 308, 298, 310, 300, 299, 307, 316, 313, ...
3    [316, 322, 321, 323, 325, 307, 311, 314, 317, ...
4    [337, 324, 327, 328, 325, 338, 332, 334, 314, ...
5    [330, 328, 334, 336, 340, 322, 331, 320, 326, ...
Name: GRE Score, dtype: object

In [115]:
#63 Find the average of all numeric columns grouped by Research.
dd = df1.copy()
avg_num = dd.groupby('Research').mean()
avg_num

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Chance of Admit
Research,,,,,,,,
0,208.519337,309.491713,104.143646,2.524862,2.908840,3.060773,8.257182,0.637680
1,193.872146,322.853881,110.109589,3.552511,3.805936,3.776256,8.881370,0.795982

In [131]:
# 64 Get the count of applicants having CGPA > 9 grouped by Research.
dd = df1.copy()

cgpa_9 = dd[dd['CGPA'] > 9]
count = cgpa_9.groupby('Research')['CGPA'].count()
count

Research
0      9
1    104
Name: CGPA, dtype: int64

In [138]:
#65 For each SOP rating, find mean Chance of Admit.
dd = df1.copy()

sop = dd.groupby('SOP')
sop['Chance of Admit '].mean()

SOP
1.0    0.538333
1.5    0.521500
2.0    0.602727
2.5    0.651277
3.0    0.683594
3.5    0.713571
4.0    0.778000
4.5    0.843962
5.0    0.883514
Name: Chance of Admit , dtype: float64

In [142]:
#66 Calculate mean and std deviation of GRE Score per University Rating.
dd = df1.copy()
grp = dd.groupby('University Rating')
mean = grp['GRE Score'].mean()
print(mean)

std = grp['GRE Score'].std()
print(std)

University Rating
1    303.153846
2    309.177570
3    315.954887
4    324.824324
5    328.333333
Name: GRE Score, dtype: float64
University Rating
1    7.918042
2    8.503954
3    7.748768
4    9.917962
5    8.524475
Name: GRE Score, dtype: float64

In [143]:
dd = df1.copy()

mean_std = dd.groupby('University Rating')['GRE Score'].agg(['mean','std'])
mean_std

                         mean       std
University Rating
1                  303.153846  7.918042
2                  309.177570  8.503954
3                  315.954887  7.748768
4                  324.824324  9.917962
5                  328.333333  8.524475

In [145]:
#67 Get total number of students whose Chance of Admit > 0.8 per Research.
dd = df1.copy()
admit = dd[dd['Chance of Admit '] > 0.8]
total = admit.groupby('Research').size()
total

Research
0      8
1    109
dtype: int64

In [154]:
#68 Find number of records for each distinct combination of University Rating, SOP, and LOR.
dd = df1.copy()
no_record = dd.groupby(['University Rating','SOP','LOR ']).size()
no_record

University Rating  SOP  LOR
1                  1.0  1.0      1
                        1.5      1
                        2.0      1
                        2.5      2
                   1.5  1.5      1
                                ..
5                  4.5  5.0      3
                   5.0  3.5      1
                        4.0      3
                        4.5      7
                        5.0     13
Length: 124, dtype: int64

In [158]:
#69 Get the highest GRE Score among students with Research = 0.
dd = df1.copy()

res_0 = dd[dd['Research']==0]['GRE Score'].max()
res_0

339

In [165]:
#70 Find how many students in each Research category have CGPA > 9.
dd = df1.copy()

cgpa = dd[dd['CGPA'] > 9]
cgpa.groupby('Research').count()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Chance of Admit
Research,,,,,,,,
0,9,9,9,9,9,9,9,9
1,104,104,104,104,104,104,104,104

In [170]:
#71 Calculate total GRE Score for each University Rating.
dd = df1.copy()

uni_rat = dd.groupby('University Rating')
total = uni_rat['GRE Score'].sum()
total

University Rating
1     7882
2    33082
3    42022
4    24037
5    19700
Name: GRE Score, dtype: int64

In [174]:
#72 Find mean Chance of Admit for each unique LOR score.

dd = df1.copy()
lor = dd.groupby('LOR ')
mean = lor['Chance of Admit '].mean()
mean

LOR
1.0    0.420000
1.5    0.567143
2.0    0.563158
2.5    0.632564
3.0    0.674235
3.5    0.721096
4.0    0.776364
4.5    0.858444
5.0    0.883429
Name: Chance of Admit , dtype: float64

In [181]:
# 73 Get number of students with same TOEFL Score grouped by that score.
dd = df1.copy()
stu = dd['TOEFL Score'].value_counts()

In [185]:
#74 Find the group with the maximum average Chance of Admit.
dd = df1.copy()

grp = dd.groupby('University Rating')['Chance of Admit '].mean().idxmax()
grp

np.int64(5)

In [187]:
#75 Sort dataset by GRE Score in descending order.
dd = df1.copy()
ss = dd.sort_values('GRE Score',ascending = False)

In [190]:
#76 Sort by University Rating, then CGPA.
dd = df1.copy()

dd.sort_values(['University Rating','CGPA'],ascending = False)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
202,203,340,120,5,4.5,4.5,9.91,1,0.97
203,204,334,120,5,4.0,5.0,9.87,1,0.97
385,386,335,117,5,5.0,5.0,9.82,1,0.96
24,25,336,119,5,4.0,3.5,9.80,1,0.97
34,35,331,112,5,4.0,5.0,9.80,1,0.94
...,...,...,...,...,...,...,...,...,...
79,80,294,93,1,1.5,2.0,7.36,0,0.46
347,348,299,94,1,1.0,1.0,7.34,0,0.42
348,349,302,99,1,2.0,2.0,7.25,0,0.57
28,29,295,93,1,2.0,2.0,7.20,0,0.46
58,59,300,99,1,3.0,2.0,6.80,1,0.36

In [198]:
#77 Display top 5 rows with highest Chance of Admit.
dd = df1.copy()

dd.sort_values('Chance of Admit ',ascending = False).head(5)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
24,25,336,119,5,4.0,3.5,9.80,1,0.97
202,203,340,120,5,4.5,4.5,9.91,1,0.97
143,144,340,120,4,4.5,4.0,9.92,1,0.97
203,204,334,120,5,4.0,5.0,9.87,1,0.97
384,385,340,113,4,5.0,5.0,9.74,1,0.96

In [200]:
#78 Sort values by TOEFL Score ascending.
dd = df1.copy()
dd.sort_values('TOEFL Score',ascending = True)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
368,369,298,92,1,2.0,2.0,7.88,0,0.51
79,80,294,93,1,1.5,2.0,7.36,0,0.46
28,29,295,93,1,2.0,2.0,7.20,0,0.46
347,348,299,94,1,1.0,1.0,7.34,0,0.42
78,79,296,95,2,3.0,2.0,7.54,1,0.44
...,...,...,...,...,...,...,...,...,...
202,203,340,120,5,4.5,4.5,9.91,1,0.97
212,213,338,120,4,5.0,5.0,9.66,1,0.95
203,204,334,120,5,4.0,5.0,9.87,1,0.97
81,82,340,120,4,5.0,5.0,9.50,1,0.96
25,26,340,120,5,4.5,4.5,9.60,1,0.94

In [214]:
#79 Set Serial No. as index.
dd = df1.copy()
ss = dd.set_index('Serial No.')
ss.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [209]:
#80 Reset index to default.
dd = df1.copy()

dd.reset_index(drop = True,inplace = True)

In [217]:
#81 Sort dataset by multiple columns: Research and Chance of Admit.
dd = df1.copy()
ss = dd.sort_values(['Research','Chance of Admit '])

In [219]:
#82 Sort all applicants by CGPA then GRE Score descending.
dd = df1.copy()
ss = dd.sort_values(['CGPA','GRE Score'],ascending = False)

In [222]:
#83 Retrieve bottom 10 rows after sorting by GRE Score.
dd = df1.copy()
dd.sort_values('GRE Score').tail(10)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
148,149,339,116,4,4.0,3.5,9.80,1,0.96
47,48,339,119,5,4.5,4.0,9.70,0,0.89
33,34,340,114,5,4.0,4.0,9.60,1,0.90
81,82,340,120,4,5.0,5.0,9.50,1,0.96
84,85,340,115,5,4.5,4.5,9.45,1,0.94
143,144,340,120,4,4.5,4.0,9.92,1,0.97
202,203,340,120,5,4.5,4.5,9.91,1,0.97
384,385,340,113,4,5.0,5.0,9.74,1,0.96
284,285,340,112,4,5.0,4.5,9.66,1,0.94
25,26,340,120,5,4.5,4.5,9.60,1,0.94

In [229]:
#84 Use .nlargest() to get top 5 CGPA values.
dd = df1.copy()

dd.nlargest(5,'CGPA')

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
143,144,340,120,4,4.5,4.0,9.92,1,0.97
202,203,340,120,5,4.5,4.5,9.91,1,0.97
203,204,334,120,5,4.0,5.0,9.87,1,0.97
385,386,335,117,5,5.0,5.0,9.82,1,0.96
24,25,336,119,5,4.0,3.5,9.80,1,0.97

In [230]:
#85 Use .nsmallest() to get lowest 5 TOEFL Score values.
dd = df1.copy()
dd.nsmallest(5,'TOEFL Score')

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
368,369,298,92,1,2.0,2.0,7.88,0,0.51
28,29,295,93,1,2.0,2.0,7.20,0,0.46
79,80,294,93,1,1.5,2.0,7.36,0,0.46
347,348,299,94,1,1.0,1.0,7.34,0,0.42
78,79,296,95,2,3.0,2.0,7.54,1,0.44

In [232]:
#86 Add a new DataFrame containing only students with Research = 1 and merge it with main dataset.
dd = df1.copy()

df_res = dd[dd['Research']==1]
df_merge = dd.merge(df_res, on = 'Serial No.', how = 'left')
df_merge

,Serial No.,GRE Score_x,TOEFL Score_x,University Rating_x,SOP_x,LOR _x,CGPA_x,Research_x,Chance of Admit _x,GRE Score_y,TOEFL Score_y,University Rating_y,SOP_y,LOR _y,CGPA_y,Research_y,Chance of Admit _y
0,1,337,118,4,4.5,4.5,9.65,1,0.92,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
395,396,324,110,3,3.5,3.5,9.04,1,0.82,324.0,110.0,3.0,3.5,3.5,9.04,1.0,0.82
396,397,325,107,3,3.0,3.5,9.11,1,0.84,325.0,107.0,3.0,3.0,3.5,9.11,1.0,0.84
397,398,330,116,4,5.0,4.5,9.45,1,0.91,330.0,116.0,4.0,5.0,4.5,9.45,1.0,0.91
398,399,312,103,3,3.5,4.0,8.78,0,0.67,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
399,400,333,117,4,5.0,4.0,9.66,1,0.95,333.0,117.0,4.0,5.0,4.0,9.66,1.0,0.95

In [233]:
#87 Create two DataFrames — one for Research = 0, another for Research = 1 — and concatenate them.
dd = df1.copy()

df_0 = dd[dd['Research']==0]
df_1 = dd[dd['Research'] ==1]

df_concat = pd.concat([df_0,df_1])
df_concat

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
4,5,314,103,2,2.0,3.0,8.21,0,0.65
7,8,308,101,2,3.0,4.0,7.90,0,0.68
8,9,302,102,1,2.0,1.5,8.00,0,0.50
9,10,323,108,3,3.5,3.0,8.60,0,0.45
15,16,314,105,3,3.5,2.5,8.30,0,0.54
...,...,...,...,...,...,...,...,...,...
394,395,329,111,4,4.5,4.0,9.23,1,0.89
395,396,324,110,3,3.5,3.5,9.04,1,0.82
396,397,325,107,3,3.0,3.5,9.11,1,0.84
397,398,330,116,4,5.0,4.5,9.45,1,0.91
399,400,333,117,4,5.0,4.0,9.66,1,0.95

In [238]:
#88 Merge two datasets on University Rating.

In [ ]:
#89 Join two DataFrames with same index using .join().

In [239]:
#90 Use .loc[] to select students with index from 10 to 20.
dd = df1.copy()
dd.loc[10:20]

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
10,11,325,106,3,3.5,4.0,8.4,1,0.52
11,12,327,111,4,4.0,4.5,9.0,1,0.84
12,13,328,112,4,4.0,4.5,9.1,1,0.78
13,14,307,109,3,4.0,3.0,8.0,1,0.62
14,15,311,104,3,3.5,2.0,8.2,1,0.61
15,16,314,105,3,3.5,2.5,8.3,0,0.54
16,17,317,107,3,4.0,3.0,8.7,0,0.66
17,18,319,106,3,4.0,3.0,8.0,1,0.65
18,19,318,110,3,4.0,3.0,8.8,0,0.63
19,20,303,102,3,3.5,3.0,8.5,0,0.62
20,21,312,107,3,3.0,2.0,7.9,1,0.64

In [240]:
#91 Use .iloc[] to select the first 5 rows and first 3 columns.
dd = df1.copy()

dd.iloc[0:5,0:3]

   Serial No.  GRE Score  TOEFL Score
0           1        337          118
1           2        324          107
2           3        316          104
3           4        322          110
4           5        314          103

In [243]:
#92 Display all columns except Serial No..
dd = df1.copy()

dd.loc[0: ,dd.columns != 'Serial No.']

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,337,118,4,4.5,4.5,9.65,1,0.92
1,324,107,4,4.0,4.5,8.87,1,0.76
2,316,104,3,3.0,3.5,8.00,1,0.72
3,322,110,3,3.5,2.5,8.67,1,0.80
4,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...
395,324,110,3,3.5,3.5,9.04,1,0.82
396,325,107,3,3.0,3.5,9.11,1,0.84
397,330,116,4,5.0,4.5,9.45,1,0.91
398,312,103,3,3.5,4.0,8.78,0,0.67
399,333,117,4,5.0,4.0,9.66,1,0.95

In [247]:
#93 Select only GRE Score, TOEFL Score, and CGPA columns.
dd = df1.copy()

dd[['GRE Score','TOEFL Score','CGPA']].head(5)

   GRE Score  TOEFL Score  CGPA
0        337          118  9.65
1        324          107  8.87
2        316          104  8.00
3        322          110  8.67
4        314          103  8.21

In [248]:
#94 Sort all rows in reverse alphabetical order of index.
dd = df1.copy()

dd.sort_index(ascending = False)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
399,400,333,117,4,5.0,4.0,9.66,1,0.95
398,399,312,103,3,3.5,4.0,8.78,0,0.67
397,398,330,116,4,5.0,4.5,9.45,1,0.91
396,397,325,107,3,3.0,3.5,9.11,1,0.84
395,396,324,110,3,3.5,3.5,9.04,1,0.82
...,...,...,...,...,...,...,...,...,...
4,5,314,103,2,2.0,3.0,8.21,0,0.65
3,4,322,110,3,3.5,2.5,8.67,1,0.80
2,3,316,104,3,3.0,3.5,8.00,1,0.72
1,2,324,107,4,4.0,4.5,8.87,1,0.76
0,1,337,118,4,4.5,4.5,9.65,1,0.92

In [256]:
#95 Extract rows with even index numbers only.
dd = df1.copy()

dd[dd.index % 2 == 0].head(5)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
2,3,316,104,3,3.0,3.5,8.00,1,0.72
4,5,314,103,2,2.0,3.0,8.21,0,0.65
6,7,321,109,3,3.0,4.0,8.20,1,0.75
8,9,302,102,1,2.0,1.5,8.00,0,0.50

In [266]:
#96 Display first and last 3 rows of dataset together.
dd = df1.copy()

pd.concat([dd.head(3),dd.tail(3)],axis = 0)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
397,398,330,116,4,5.0,4.5,9.45,1,0.91
398,399,312,103,3,3.5,4.0,8.78,0,0.67
399,400,333,117,4,5.0,4.0,9.66,1,0.95

In [281]:
#97 Combine two DataFrames vertically using pd.concat().
dd = df1.copy()

a = dd.head(5)
b = dd.tail(5)

pd.concat([a,b],axis = 0)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65
395,396,324,110,3,3.5,3.5,9.04,1,0.82
396,397,325,107,3,3.0,3.5,9.11,1,0.84
397,398,330,116,4,5.0,4.5,9.45,1,0.91
398,399,312,103,3,3.5,4.0,8.78,0,0.67
399,400,333,117,4,5.0,4.0,9.66,1,0.95

In [297]:
#98 Sort dataset based on the rounded value of Chance of Admit.
dd = df1.copy()

dd['Rounded'] = dd['Chance of Admit '].round(0)
d1 = dd.sort_values('Rounded')
d1

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,Rounded
27,28,298,98,2,1.5,2.5,7.50,1,0.44,0.0
28,29,295,93,1,2.0,2.0,7.20,0,0.46,0.0
374,375,315,105,2,2.0,2.5,7.65,0,0.39,0.0
375,376,304,101,2,2.0,2.5,7.66,0,0.38,0.0
376,377,297,96,2,2.5,2.0,7.43,0,0.34,0.0
...,...,...,...,...,...,...,...,...,...,...
20,21,312,107,3,3.0,2.0,7.90,1,0.64,1.0
19,20,303,102,3,3.5,3.0,8.50,0,0.62,1.0
18,19,318,110,3,4.0,3.0,8.80,0,0.63,1.0
17,18,319,106,3,4.0,3.0,8.00,1,0.65,1.0
16,17,317,107,3,4.0,3.0,8.70,0,0.66,1.0

In [298]:
#100 Rearrange columns alphabetically.
dd = df1.copy()

dd[sorted(dd.columns)]

,CGPA,Chance of Admit,GRE Score,LOR,Research,SOP,Serial No.,TOEFL Score,University Rating
0,9.65,0.92,337,4.5,1,4.5,1,118,4
1,8.87,0.76,324,4.5,1,4.0,2,107,4
2,8.00,0.72,316,3.5,1,3.0,3,104,3
3,8.67,0.80,322,2.5,1,3.5,4,110,3
4,8.21,0.65,314,3.0,0,2.0,5,103,2
...,...,...,...,...,...,...,...,...,...
395,9.04,0.82,324,3.5,1,3.5,396,110,3
396,9.11,0.84,325,3.5,1,3.0,397,107,3
397,9.45,0.91,330,4.5,1,5.0,398,116,4
398,8.78,0.67,312,4.0,0,3.5,399,103,3
399,9.66,0.95,333,4.0,1,5.0,400,117,4